Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem.SetOptions Method (List<KeyValuePair<Double, String>>)
 Sets the value options of a double property. The maximum count of options is 400.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetOptions(
	List<KeyValuePair<double, string>> DoubleOptions
)
Public Function SetOptions (
	DoubleOptions As List(Of KeyValuePair(Of Double, String))
) As Boolean
Parameters
DoubleOptions
Type: System.Collections.Generic.List<KeyValuePair<Double, String>>
The value options.
Return Value
Type: Boolean
True on success.
See Also
Reference
UserPropertyItem Class
SetOptions Overload
Tekla.Structures.Catalogs Namespace